heat-exchanger-simplified/fluid2-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid2;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              Fluid2-Mesh;
    patches           (interface);
    
    readData
    (
      Heat-Flux2
    );
    
    writeData
    (
      Temperature2
    );
  };
};
